name: "test_relu_layer"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 16 dim: 16 } }
}
layer {
  name: "relu"
  type: "ReLU"
  top: "relu"
  bottom: "data"
}
